Documents/АктВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктВыполненныхРабот</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктВыполненныхРабот/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
    //{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
    Макет = Документы.АктВыполненныхРабот.ПолучитьМакет("Печать");
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
        | АктВыполненныхРабот.Дата,
        | АктВыполненныхРабот.Контрагент,
        | АктВыполненныхРабот.Номер,
        | АктВыполненныхРабот.Услуги.(
        |     ВидДеятельности,
        |     СуммаБезНДС,
        |     Ставка,
        |     СуммаНДС,
        |     Всего
        | )
        |ИЗ
        | Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
        |ГДЕ
        | АктВыполненныхРабот.Ссылка В (&Ссылка)";
    
    Запрос.Параметры.Вставить("Ссылка", Ссылка);
    Выборка = Запрос.Выполнить().Выбрать();
    
    // Получение констант
    НаименованиеОрганизации = Константы.НаименованиеОрганизации.Получить();
    Директор = Константы.Директор.Получить();
    
    Шапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
    ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
    ОбластьПодписьКонтрагента = Макет.ПолучитьОбласть("ОбластьПодписьКонтрагента"); 
    
    // ⬇️ Добавлено для итогов
    ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
    ИтогоСуммаБезНДС = 0;
    ИтогоСуммаНДС = 0;
    ИтогоВсего = 0;
    
    ТабДок.Очистить();
    ВставлятьРазделительСтраниц = Ложь;
    
    Пока Выборка.Следующий() Цикл
        Если ВставлятьРазделительСтраниц Тогда
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        
        // Заполнение параметров области Шапка
        Шапка.Параметры.Заполнить(Выборка);
        Шапка.Параметры.НаименованиеОрганизации = НаименованиеОрганизации;
        Шапка.Параметры.Директор = Директор;
        
        Если ЗначениеЗаполнено(Выборка.Дата) И Выборка.Дата <> Дата('00010101') Тогда
            Шапка.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
        Иначе
            Шапка.Параметры.Дата = "";
        КонецЕсли;
        
        ТабДок.Вывести(Шапка, Выборка.Уровень());
        ТабДок.Вывести(ОбластьУслугиШапка);
        
        ВыборкаУслуги = Выборка.Услуги.Выбрать();
        Пока ВыборкаУслуги.Следующий() Цикл
            ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
            ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень()); 
            
            // ⬇️ Добавлено: подсчёт итогов
            ИтогоСуммаБезНДС = ИтогоСуммаБезНДС + ВыборкаУслуги.СуммаБезНДС;
            ИтогоСуммаНДС = ИтогоСуммаНДС + ВыборкаУслуги.СуммаНДС;
            ИтогоВсего = ИтогоВсего + ВыборкаУслуги.Всего;
            
        КонецЦикла;
        
    // ⬇️ Вывод строки итогов
    ОбластьИтоги.Параметры.ИтогоСуммаБезНДС = ИтогоСуммаБезНДС;
    ОбластьИтоги.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДС;
    ОбластьИтоги.Параметры.ИтогоВсего = ИтогоВсего;
    ТабДок.Вывести(ОбластьИтоги);     
    ТабДок.Вывести(ОбластьПодписьКонтрагента);

        
        ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;
    //}}
КонецПроцедуры
